const questions = [

{
title:"سؤال ۱",
question:"بیستمین عدد زوج کدام است؟",
options:["20","40","22","38"],
answer:1
},

{
title:"سؤال ۲",
question:"بیست و هفتمین عدد فرد کدام است؟",
options:["53","55","51","57"],
answer:0
},

{
title:"سؤال ۳",
question:"عدد 128 چندمین عدد زوج است؟",
options:["32","64","128","256"],
answer:1
},

{
title:"سؤال ۴",
question:"عدد 99 چندمین عدد فرد است؟",
options:["48","49","50","51"],
answer:2
},

{
title:"سؤال ۵",
question:"کدام عدد زوج است؟",
options:["45","53","78","91"],
answer:2
},

{
title:"سؤال ۶",
question:"کدام عدد فرد است؟",
options:["82","64","96","79"],
answer:3
},

{
title:"سؤال ۷",
question:"اگر 2 را به یک عدد زوج اضافه کنیم، حاصل ...",
options:[
"فرد می‌شود",
"زوج می‌ماند",
"صفر می‌شود",
"مشخص نیست"
],
answer:1
},

{
title:"سؤال ۸",
question:"اگر 1 را به یک عدد زوج اضافه کنیم، حاصل ...",
options:[
"زوج است",
"فرد است",
"صفر است",
"مشخص نیست"
],
answer:1
},

{
title:"سؤال ۹",
question:"اگر 1 را از یک عدد فرد کم کنیم، حاصل ...",
options:[
"فرد است",
"زوج است",
"صفر است",
"مشخص نیست"
],
answer:1
},

{
title:"سؤال ۱۰",
question:"اگر 2 را از یک عدد فرد کم کنیم، حاصل ...",
options:[
"فرد است",
"زوج است",
"صفر است",
"مشخص نیست"
],
answer:0
},

{
title:"سؤال ۱۱",
question:"بین عددهای 1 تا 20 چند عدد زوج وجود دارد؟",
options:["9","10","11","12"],
answer:1
},

{
title:"سؤال ۱۲",
question:"بین عددهای 1 تا 30 چند عدد فرد وجود دارد؟",
options:["14","15","16","17"],
answer:1
},

{
title:"سؤال ۱۳",  
question:"اگر سه عدد زوجِ پشت سر هم را با هم جمع کنیم، حاصل همیشه ...",
options:[
"زوج است",
"فرد است",
"گاهی زوج و گاهی فرد",
"مشخص نیست"
],
answer:0
},

{
title:"سؤال ۱۴",
question:"اگر سه عدد فردِ پشت سر هم را با هم جمع کنیم، حاصل همیشه ...",
options:[
"زوج است",
"فرد است",
"گاهی زوج و گاهی فرد",
"مشخص نیست"
],
answer:1
},

{
title:"سؤال ۱۵",
question:"بزرگ‌ترین عدد زوج دو رقمی کدام است؟",
options:["97","98","99","100"],
answer:1
},

{
title:"سؤال ۱۶",
question:"مجموع دو عدد زوج همیشه ...",
options:[
"زوج است",
"فرد است",
"گاهی زوج و گاهی فرد",
"مشخص نیست"
],
answer:0
},

{
title:"سؤال ۱۷",
question:"مجموع دو عدد فرد همیشه ...",
options:[
"زوج است",
"فرد است",
"گاهی زوج و گاهی فرد",
"مشخص نیست"
],
answer:0
},

{
title:"سؤال ۱۸",
question:"مجموع یک عدد زوج و یک عدد فرد همیشه ...",
options:[
"زوج است",
"فرد است",
"صفر می‌شود",
"مشخص نیست"
],
answer:1
},

{
title:"سؤال ۱۹",
question:"کوچک‌ترین عدد فرد سه رقمی کدام است؟",
options:["99","100","101","103"],
answer:2
},

{
title:"سؤال ۲۰",
question:"کدام گزینه درست است؟",
options:[
"هر عددی که بر 2 بخش‌پذیر باشد زوج است.",
"هر عدد زوج بر 3 بخش‌پذیر است.",
"همه عددهای فرد از 5 بزرگ‌ترند.",
"عدد صفر فرد است."
],
answer:0
}

];
